OpenFOAM-2112/flowAroundCylinderGradientAMR/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.3 -0.02 -0.4)
    ( 1.1 -0.02 -0.4)
    ( 1.1 0.02 -0.4)
    (-0.3 0.02 -0.4)

    (-0.3 -0.02 0.4)
    ( 1.1 -0.02 0.4)
    ( 1.1  0.02 0.4)
    (-0.3  0.02 0.4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (91 2 52) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch sides
    (
        (0 1 5 4)
        (2 3 7 6)
    )
    patch bottom
    (
        (0 3 2 1)
    )
    patch top
    (
        (4 5 6 7)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (1 2 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
